Repository: faradzhalelov/wedding
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

# test
source: This is a test string for English localization.
kk: Бұл қазақша локализация үшін тест жолы.
ru: Это тестовая строка для русской локализации.

# dressCodeLabel
source: DRESS CODE
kk: КИІМ КОДЕКСІ
ru: ДРЕСС-КОД

source: Free Classic Style
kk: Еркін Классикалық Стиль
ru: Свободный Классический Стиль

# dressCodeDescription
source: We invite you to join us in an atmosphere of modern elegance. Think clean lines, monochrome palettes, and sophisticated comfort suitable for our urban Astana celebration.
kk: Сіздерді заманауи сәнділіктің атмосферасына қосылуға шақырамыз. Астанадағы қалалық мерекелік шараға арналған таза сызықтар, монохромды палитралар және талғампаз жайлылық.
ru: Приглашаем вас присоединиться к нам в атмосфере современной элегантности. Чистые линии, монохромные палитры и изысканный комфорт, подходящие для нашего городского празднования в Астане.

# paletteLabel
source: PALETTE
kk: ПАЛИТРА
ru: ПАЛИТРА

# colorBlack
source: Black
kk: Қара
ru: Черный

# colorGrey
source: Grey
kk: Сұр
ru: Серый

# colorWhite
source: White
kk: Ақ
ru: Белый

# colorBeige
source: Beige
kk: Бежевый

# colorNavy
source: Navy
kk: Көк

# colorBurgundy
source: Burgundy
kk: Бордо

# colorOlive
source: Olive
kk: Зәйтүн

# colorRed
source: Red Accent
kk: Қызыл
ru: Красный

# guidelineMonochromeTitle
source: Monochrome
kk: Монохром
ru: Монохром

# guidelineMonochromeDesc
source: Stick to black, white, grey, or muted earth tones. We are aiming for a cohesive, editorial vibe for our wedding photos.
kk: Қара, ақ, сұр немесе бәсеңдетілген жер түстерін қолданыңыз. Біз үйлену фотосуреттері үшін үйлесімді стильге ұмтыламыз.
ru: Придерживайтесь черного, белого, серого или приглушенных земляных тонов. Мы стремимся к единому стилю для наших свадебных фотографий.

# guidelineModernTitle
source: Modern Silhouettes
kk: Заманауи Силуэттер
ru: Современные Силуэты

# guidelineModernDesc
source: Opt for tailored suits, slip dresses, and structured blazers. Clean lines over complex patterns.
kk: Тігілген костюмдер, комбинация көйлектер және құрылымды блейзерлерді таңдаңыз. Күрделі өрнектердің орнына таза сызықтар.
ru: Выбирайте скроенные костюмы, платья-комбинации и структурированные блейзеры. Чистые линии вместо сложных узоров.

# guidelineComfortTitle
source: Comfortable Elegance
kk: Жайлы Сәнділік
ru: Комфортная Элегантность

# guidelineComfortDesc
source: Look sharp but feel free to move. No stiff tuxedos required. Smart casual means polished but relaxed.
kk: Сәнді болыңыз, бірақ өзіңізді еркін сезініңіз. Қатаң смокингтер қажет емес. Smart casual дегеніміз - талғампаздық пен еркіндік.
ru: Выглядите стильно, но чувствуйте себя свободно. Строгие смокинги не требуются. Smart casual означает изысканность и непринужденность.

# aestheticTitle
source: The Aesthetic
kk: Эстетика
ru: Эстетика

# inspirationSubtitle
source: Curated Inspiration
kk: Шабыт
ru: Вдохновение

# inspirationMensTailoring
source: Men's Tailoring
kk: Ерлер Классикасы
ru: Мужская Классика

# inspirationMinimalist
source: Minimalist Silhouettes
kk: Минималистік Силуэттер
ru: Минималистичные Силуэты

# inspirationFootwear
source: Polished Footwear
kk: Талғампаз Аяқ Киім
ru: Изысканная Обувь

# inspirationModern
source: Modern Elegance
kk: Заманауи Сәнділік
ru: Современная Элегантность

# doListTitle
source: PLEASE DO
kk: БОЛАДЫ
ru: МОЖНО

# doItem1
source: Wear Blazers, Loafers, Slip Dresses, and Jumpsuits.
kk: Блейзерлер, лоферлер, комбинация көйлектер және комбинезондар киіңіз.
ru: Носите блейзеры, лоферы, платья-комбинации и комбинезоны.

# doItem2
source: Choose monochrome palettes (Black, White, Grey).
kk: Монохромды палитраларды таңдаңыз (қара, ақ, сұр).
ru: Выбирайте монохромные палитры (черный, белый, серый).

# doItem3
source: Opt for midi lengths, silk fabrics, and minimal jewelry.
kk: Миди ұзындығын, жібек маталарды және минималды әшекейлерді таңдаңыз.
ru: Выбирайте длину миди, шелковые ткани и минимальные украшения.

# doItem4
source: Feel comfortable. Relaxed tailoring is encouraged.
kk: Өзіңізді жайлы сезініңіз. Еркін тігін қош келді.
ru: Чувствуйте себя комфортно. Непринужденный крой приветствуется.

# dontListTitle
source: PLEASE DON'T
kk: БОЛМАЙДЫ
ru: НЕ НАДО

# dontItem1
source: Wear Jeans, T-shirts, or Athletic Sneakers.
kk: Джинсы, футболка немесе спорттық кроссовка киюге болмайды.
ru: Носить джинсы, футболки или спортивные кроссовки.

# dontItem2
source: Wear Neon or overly bright colors.
kk: Неон немесе тым жарқын түстер киюге болмайды.
ru: Носить неоновые или слишком яркие цвета.

# dontItem3
source: Wear heavily patterned or branded clothing.
kk: Ірі өрнектері бар немесе брендті логотиптері бар киім киюге болмайды.
ru: Носить одежду с крупными узорами или брендовыми логотипами.

# dontItem4
source: Feel pressured to wear a full tuxedo.
kk: Толық смокинг киюге мәжбүр сезінбеңіз.
ru: Чувствовать необходимость надевать полный смокинг.

source: THE CELEBRATION
kk: МЕРЕКЕ
ru: ПРАЗДНИК

# monthJune
source: June
kk: Маусым
ru: Июнь

# day24th
source: 27th
kk: 27-ші
ru: 27-е

# locationAstana
source: Astana, Kazakhstan
kk: Астана, Қазақстан
ru: Астана, Казахстан

# locationSubtitle
source: The Capital City
kk: Астана қаласы
ru: Столица

# venueGuestHouse
source: ​Tumar Banquet Hall
kk: ​Банкетный зал Tumar
ru: ​Банкетный зал Tumar

# venueMainBallroom
source: Zheltoksan Street, 2t
kk: Улица Желтоксан, 2т
ru: Улица Желтоксан, 2т

source: Add to Calendar
kk: Күнтізбеге қосу
ru: Добавить в календарь

source: Getting There
kk: Жету жолы
ru: Как добраться

# gettingThereDesc
source: The Guest House is located in the heart of Astana.
kk: Қонақ үй Астананың орталығында орналасқан.
ru: Гостевой дом находится в самом центре Астаны.

source: Venue
kk: Орын
ru: Место проведения

source: Get Directions
kk: Бағыт алу
ru: Проложить маршрут

source: Order of Events
kk: Іс-шаралар бағдарламасы
ru: Программа мероприятия

# orderOfEventsDesc
source: A guide to our special day.
kk: Біздің ерекше күнімізге нұсқаулық.
ru: План нашего особенного дня.

# event1Tag
source: Arrival
kk: Келу
ru: Прибытие

# event1Title
source: Welcome Gathering
kk: Қонақтарды қарсы алу
ru: Приветствие гостей

# event1Desc
source: Guests arrive. Light refreshments and cocktails will be served in the garden foyer.
kk: Қонақтар келеді. Бақша фойесінде жеңіл тағамдар мен коктейльдер ұсынылады.
ru: Прибытие гостей. Легкие закуски и коктейли будут поданы в садовом фойе.

# event2Tag
source: Main Event
kk: Негізгі оқиға
ru: Главное событие

# event2Title
source: The Ceremony
kk: Рәсім
ru: Церемония

# event2Desc
source: We say "I do" in the Grand Hall. Please be seated by 16:45.
kk: Біз Үлкен залда "Иә" деп айтамыз. 16:45-ке дейін орын алыңыз.
ru: Мы скажем "Да" в Большом зале. Пожалуйста, займите места к 16:45.

# event3Tag
source: Reception
kk: Банкет
ru: Банкет

# event3Title
source: Dinner & Toasts
kk: Кешкі ас және тостар
ru: Ужин и тосты

# event3Desc
source: A three-course dinner featuring local delicacies, followed by speeches from family and friends.
kk: Жергілікті тағамдардан тұратын үш курстық кешкі ас, одан кейін отбасы мен достардың сөздері.
ru: Ужин из трех блюд с местными деликатесами, за которым последуют речи от семьи и друзей.

# event4Tag
source: Party
kk: Кеш
ru: Вечеринка

# event4Title
source: Dancing
kk: Би
ru: Танцы

# event4Desc
source: Live music performance followed by a DJ set until midnight.
kk: Тікелей музыка орындауы, одан кейін түн ортасына дейін диджей сеті.
ru: Живая музыка, за которой последует диджей-сет до полуночи.

# event5Tag
source: Finale
kk: Финал
ru: Финал

# event5Title
source: Farewell
kk: Қоштасу
ru: Прощание

# event5Desc
source: Sparkler send-off for the newlyweds.
kk: Жаңа отбасын бенгал оттарымен шығарып салу.
ru: Проводы молодоженов с бенгальскими огнями.

source: Can you make it?
kk: Келе аласыз ба?
ru: Сможете ли вы прийти?

# honoredToHaveYou
source: We would be honored to have you celebrate with us.
kk: Сіздермен бірге мерекелеу біз үшін үлкен құрмет.
ru: Для нас будет честью отпраздновать этот день вместе с вами.

# astanaCity
source: ASTANA
kk: АСТАНА
ru: АСТАНА

# designedWithLove
source: Designed with love for Riza & Farkhat
kk: Риза мен Фархат үшін махаббатпен жасалды
ru: Создано с любовью для Ризы и Фархата

# memoriesLabel
source: Memories
kk: Естеліктер
ru: Воспоминания

source: Our Story in Photos
kk: Біздің тарихымыз суреттерде
ru: Наша история в фотографиях

# memoriesSubtitle
source: From childhood memories to the journey that brought us together.
kk: Балалық естеліктерден бізді біріктірген жолға дейін.
ru: От детских воспоминаний до пути, который свел нас вместе.

source: Two Lives,
kk: Екі өмір,
ru: Две жизни,

source: One Path.
kk: Бір жол.
ru: Один путь.

# memoryDescMobile
source: From childhood memories in the streets of Astana to our journey together. A visual diary of the moments that shaped us.
kk: Астана көшелеріндегі балалық естеліктерден бірге өткен жолымызға дейін. Бізді қалыптастырған сәттердің визуалды күнделігі.
ru: От детских воспоминаний на улицах Астаны до нашего совместного пути. Визуальный дневник моментов, которые сформировали нас.

# memoryDescDesktop
source: From childhood memories in the streets of Astana to our journey across the world together. A visual diary of the moments that shaped us.
kk: Астана көшелеріндегі балалық естеліктерден бірге әлем бойынша саяхатымызға дейін. Бізді қалыптастырған сәттердің визуалды күнделігі.
ru: От детских воспоминаний на улицах Астаны до нашего путешествия по миру вместе. Визуальный дневник моментов, которые сформировали нас.

source: ESTABLISHED
kk: ҚҰРЫЛДЫ
ru: ОСНОВАНО

# galleryRiza
source: Riza
kk: Риза
ru: Риза

# galleryRizaCaption
source: With her favorite toy
kk: С любимой игрушкой
ru: С любимой игрушкой

# galleryFarkhat
source: Farkhat
kk: Фархат
ru: Фархат

# galleryFarkhatCaption
source: At home
kk: Циркте
ru: В цирке

# galleryFirstDate
source: First Date
kk: Алғашқы кездесу
ru: Первое свидание

# galleryFirstDateCaption
source: Sunny Line
kk: Солнечная линия
ru: Солнечная линия

# galleryTogether
source: Together
kk: Бірге
ru: Вместе

# galleryTogetherCaption
source: A look that says everything.
kk: Бәрін айтатын көз қарас.
ru: Взгляд, который говорит обо всем.

# galleryOurCity
source: Our City
kk: Біздің қала
ru: Наш город

# galleryOurCityCaption
source: Where it all began.
kk: Бәрі осыдан басталды.
ru: Где все началось.

# galleryTheYes
source: The Yes
kk: Иә
ru: Да

# galleryTheYesCaption
source: A promise for forever.
kk: Мәңгілік уәде.
ru: Обещание навсегда.

# heroEyebrow
source: THE WEDDING CELEBRATION
kk: ТОЙ МЕРЕКЕСІ
ru: СВАДЕБНОЕ ТОРЖЕСТВО

# heroLocation
source: ASTANA, KAZAKHSTAN
kk: АСТАНА, ҚАЗАҚСТАН
ru: АСТАНА, КАЗАХСТАН

# heroDate
source: JUNE 2026
kk: МАУСЫМ 2026
ru: ИЮНЬ 2026

# heroSaveTheDate
source: Save the Date
kk: Күнді есте сақтаңыз
ru: Сохраните дату

# heroConfirmButton
source: CONFIRM ATTENDANCE
kk: ҚАТЫСУДЫ РАСТАУ
ru: ПОДТВЕРДИТЬ ПРИСУТСТВИЕ

# navRsvpButton
source: RSVP NOW
kk: РАСТАУ
ru: ПОДТВЕРДИТЬ

# rsvpYourName
source: Your Name
kk: Сіздің атыңыз
ru: Ваше имя

# rsvpEnterFullName
source: Enter your full name
kk: Толық атыңызды енгізіңіз
ru: Введите полное имя

# rsvpPleaseEnterName
source: Please enter your name
kk: Атыңызды енгізіңіз
ru: Пожалуйста, введите ваше имя

# rsvpWillAttend
source: Will you be attending?
kk: Қатысасыз ба?
ru: Вы будете присутствовать?

# rsvpJoyfullyAccept
source: Joyfully Accept
kk: Қуана қабылдаймын
ru: С радостью принимаю

# rsvpCantWait
source: Can't wait to celebrate!
kk: Мереке күтпеймін!
ru: Не могу дождаться празднования!

# rsvpRegretfullyDecline
source: Regretfully Decline
kk: Өкініштімен бас тартамын
ru: С сожалением отказываюсь

# rsvpInSpirit
source: Will be there in spirit
kk: Рухпен бірге боламын
ru: Буду с вами в духе

# rsvpNumberOfGuests
source: Number of Guests
kk: Қонақтар саны
ru: Количество гостей

# rsvpPeople
source: people
kk: адам
ru: человек

# rsvpDietaryRequirements
source: Dietary Requirements
kk: Диеталық талаптар
ru: Диетические требования

# rsvpAllergies
source: Any allergies or special requests?
kk: Аллергия немесе ерекше тілектер бар ма?
ru: Есть ли аллергии или особые пожелания?

# rsvpAccommodate
source: We will do our best to accommodate your needs.
kk: Біз сіздің қажеттіліктеріңізді ескеруге тырысамыз.
ru: Мы постараемся учесть ваши пожелания.

# rsvpYourEmail
source: Your Email
kk: Сіздің email
ru: Ваш email

# rsvpPleaseEnterEmail
source: Please enter your email
kk: Email енгізіңіз
ru: Пожалуйста, введите email

# rsvpValidEmail
source: Please enter a valid email
kk: Дұрыс email енгізіңіз
ru: Пожалуйста, введите корректный email

# rsvpRespondBy
source: Please respond by the end of February
kk: Февраль айының соңына дейін жауап беріңіз
ru: Пожалуйста, ответьте до конца февраля

# rsvpConfirmButton
source: CONFIRM ATTENDANCE
kk: ҚАТЫСУДЫ РАСТАУ
ru: ПОДТВЕРДИТЬ ПРИСУТСТВИЕ

# rsvpPleaseJoinUs
source: PLEASE JOIN US
kk: БІЗГЕ ҚОСЫЛЫҢЫЗ
ru: ПРИСОЕДИНЯЙТЕСЬ К НАМ

# rsvpLocation
source: Astana, Kazakhstan
kk: Астана, Қазақстан
ru: Астана, Казахстан

# rsvpThankYou
source: Thank You!
kk: Рақмет сізге!
ru: Спасибо!

# rsvpResponseRecorded
source: Your response has been recorded. We look forward to celebrating with you!
kk: Сіздің жауабыңыз жазылды. Сізбен мереке құруды асыға күтеміз!
ru: Ваш ответ записан. Мы с нетерпением ждем встречи с вами!

# rsvpEventDate
source: Astana • June 2026
kk: Астана • Маусым 2026
ru: Астана • Июнь 2026

# navOurStory
source: Our Story
kk: Біздің тарих
ru: Наша история

# navDetails
source: Details
kk: Толығырақ
ru: Детали

# navDressCode
source: Dress Code
kk: Киім коды
ru: Дресс-код
